In [1]:
import pandas as pd

In [6]:
zips = pd.Series({'Boston':'02215', 'Miami':'3310', 'Chicago':'60615',
                  'Little Rock':'72202'})

In [7]:
zips

Boston         02215
Miami           3310
Chicago        60615
Little Rock    72202
dtype: object

In [8]:
zips.str.match(r'\d{5}')

Boston          True
Miami          False
Chicago         True
Little Rock     True
dtype: bool

In [14]:
print('zipcode work completed by Malcolm Phillip')

zipcode work completed by Malcolm Phillip

In [15]:
cities = pd.Series(['Boston, MA 02215', 'Miami, FL 33101', 'Chicago, IL 60615',
                  'Little Rock, AR 72202'])

In [17]:
cities

0         Boston, MA 02215
1          Miami, FL 33101
2        Chicago, IL 60615
3    Little Rock, AR 72202
dtype: object

In [18]:
cities.str.contains(r' [A-Z]{2} ')

0    True
1    True
2    True
3    True
dtype: bool

In [20]:
cities.str.match(r' [A-Z]{2} ')

0    False
1    False
2    False
3    False
dtype: bool

In [21]:
print('city names work completed by Malcolm Phillip')

city names work completed by Malcolm Phillip

In [23]:
contacts = [['Mike Jones', 'mikejones@gmail.com', '5551238004'],
            ['Michael Jackson', 'michaeljackson@yahoo.com', '5553214008'],
            ['Ed Sheeran', 'edwardsheeran@outlook.com', '5552311579'],
           ['Chicago Bears', 'chitownbears@info.com', '7736061544']]

In [24]:
contactsdf = pd.DataFrame(contacts, columns=['Name', 'Email', 'Phone'])

In [25]:
contactsdf

              Name                      Email       Phone
0       Mike Jones        mikejones@gmail.com  5551238004
1  Michael Jackson   michaeljackson@yahoo.com  5553214008
2       Ed Sheeran  edwardsheeran@outlook.com  5552311579
3    Chicago Bears      chitownbears@info.com  7736061544

In [26]:
import re

In [27]:
def get_formatted_phone(value):
    result = re.fullmatch(r'(\d{3})(\d{3})(\d{4})', value)
    return '-'.join(result.groups()) if result else value

In [29]:
formatted_phone = contactsdf['Phone'].map(get_formatted_phone)

In [30]:
formatted_phone

0    555-123-8004
1    555-321-4008
2    555-231-1579
3    773-606-1544
Name: Phone, dtype: object

In [31]:
contactsdf['Phone'] = formatted_phone

In [32]:
contactsdf

              Name                      Email         Phone
0       Mike Jones        mikejones@gmail.com  555-123-8004
1  Michael Jackson   michaeljackson@yahoo.com  555-321-4008
2       Ed Sheeran  edwardsheeran@outlook.com  555-231-1579
3    Chicago Bears      chitownbears@info.com  773-606-1544

In [33]:
print('DataFrames & reformatting work completed by Malcolm Phillip')

DataFrames & reformatting work completed by Malcolm Phillip